# RbsHvacloadRoofAreaParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsHvacloadRoofAreaParam Property
ParameterTypeId Class See Also
---
"Roof Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsHvacloadRoofAreaParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsHvacloadRoofAreaParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsHvacloadRoofAreaParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace